Repository: hasnain-naveed/xblock-poll
Catalog: poll/conf/locale/*/LC_MESSAGES/django.po
Languages: ar, he

source: Submit
ar: إرسال
he: חיפוש

source: Thank you.
ar: شكرًا.
he: תודה.

source: You have used
ar: لديك
he: השתמשת

source: out of
ar: من
he: מתוך

source: submissions
ar: التسليمات
he: הרשמות

source: Feedback
ar: اترك تقييم للخدمة
he: משוב

source: View results
ar: اعرض النتائج
he: הצג תוצאות

source: Display Name
ar: اسم العرض
he: שם תצוגה

source: Question/Prompt
ar: سؤال/موجه
he: שאלה/בקשה

source: Markdown Syntax
ar: بناء جملة مصغر
he: תחביר הוזלה

source: is supported.
ar: معتمد.

source: Enter the prompt for the user.
ar: أدخل في الموجه للمستخدم.
he: הזן את שורת הפקודה עבור המשתמש.

source: This text will be displayed for the user as some extra feedbackafter they have submitted their response to the poll.
ar: سيتم عرض هذا النص للمستخدم كبعض فيدباكافتير الإضافية التي قدمتها استجابتها للاستطلاع.
he: טקסט זה יוצג עבור המשתמש כמו משוב נוסף לאחר ששלחו את תשובתם לסקר.

source: Private Results
ar: النتائج الخاصة
he: פרטי תוצאות

source: True
ar: صح
he: נכון

source: False
ar: خطأ
he: לא

source: If this is set to True, don't display results of the poll to the user.
ar: إذا تم تعيين هذا إلى True، لا عرض نتائج استطلاع الرأي للمستخدم.
he: אם זה מוגדר כ- True, אל תציג תוצאות הסקר למשתמש.

source: Maximum Submissions
ar: عروض كحد أقصى
he: הגשות המרבי

source: Maximum number of times a user may submit a poll.
ar: الحد الأقصى لعدد مرات مستخدم قد يقدم استطلاع للرأي.
he: המספר המירבי של פעמים שמשתמש, תוכלו להגיש סקר.

source: Setting this to a value other than 1 will imply that 'Private Results' should be true.
ar: يؤدي هذا إلى قيمة خلاف 1 يعني أن 'النتائج الخاصة' ينبغي أن يكون صحيحاً.
he: הגדרת זה ערך שאינו 1 לרמוז כי 'פרטי תוצאות' צריך להיות נכון.

source: Setting it to 0 will allow infinite resubmissions.
ar: تعيين إلى 0 سيسمح تكراراً لا حصر لها.
he: הגדרת את זה ל- 0, יאפשר resubmissions אינסופי.

source: Notes
ar: الملاحظات
he: הערות

source: If you change an answer's text, all students who voted for that choice will have their votes updated tothe new text. You'll want to avoid changing an answer from something like 'True' to 'False', accordingly.If you delete an answer, any votes for that answer will also be deleted. Students whose choices are deletedmay vote again, but will not lose course progress.
ar: إذا قمت بتغيير النص للإجابة، جميع الطلاب الذين صوتوا لهذا الخيار سوف يكون تصويتهم تحديث للنص الجديد. أنت تريد تجنب تغيير جوابا من شيء من هذا القبيل 'True' إلى 'False'، تبعاً لذلك. إذا قمت بحذف إجابة، سيتم أيضا حذف أي أصوات لأن الإجابة. الطلاب الذين الاختيارات ديليتيدماي التصويت مرة أخرى، ولكن لن تفقد التقدم بالطبع.
he: אם אתה משנה את הטקסט של תשובה, כל התלמידים שהצביעו בעד ההחלטה הזאת יהיו קולות שלהם מעודכן כדי הטקסט החדש. רצוי להימנע לשנות תשובה ממשהו כמו 'נכון' כ- 'False', בהתאם לכך. אם תמחק תשובה, קולות על התשובה גם יימחקו. סטודנטים אשר בחירות הן deletedmay להצביע שוב, אבל לא תאבד התקדמות הקורס.

source: Questions must be similarly cared for. If a question's text is changed, any votes for that question will remain.If a question is deleted, any student who previously took the survey will be permitted to retake it, but will notlose course progress.
ar: يجب أن تكون رعاية شؤون المثل. إذا تم تغيير نص السؤال، سيظل أي أصوات لهذا السؤال. إذا تم حذف سؤال، ولن يسمح أي طالب الذي تولي سابقا الدراسة الاستقصائية لاستعادة، ولكن سوف نوتلوسي بالطبع إحراز تقدم.
he: שאלות חייב להיות דומה מחבורתו. אם הטקסט של שאלה משתנה, יישאר קולות על השאלה. אם שאלה נמחק, כל סטודנט אשר בעבר לקח את הסקר יורשו לחזור על המבחן, אך יהיה notlose מסלול התקדמות.

source: Add Answer
ar: إضافة إجابة
he: הוספת תשובה

source: Add Question
ar: اضافة سؤال
he: שאלה

source: Save
ar: حفظ
he: שמירה

source: Cancel
ar: إلغاء
he: בטל

source: is supported
he: נתמך
